# my Brewfile for setting up a new Mac
# @robertmitchellv | robertmitchellv.com

# run `brew doctor` before running !!!

# Four times of commands:
#  tap  = third-party-repositories
#  brew = main homebrew command; used to install, uninstall, update, list
#  cask = extend homebrew for GUI macOS applications
#  mas  = macOS app store

# --> taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "microsoft/mssql-release"

# --> brews
brew "openssl@1.1"
brew "gcc"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bat"
brew "bison"
brew "boost"
brew "brew-pip"
brew "readline"
brew "pkg-config"
brew "tcl-tk"
brew "cairo"
brew "carthage"
brew "coreutils"
brew "cask"
brew "ccache"
brew "libiconv"
brew "protobuf"
brew "clamav"
brew "cmake"
brew "cowsay"
brew "csvkit"
brew "libssh2"
brew "curl"
brew "darksky-weather"
brew "fastlane"
brew "libsndfile"
brew "ffmpeg"
brew "figlet"
brew "unixodbc"
brew "freetds"
brew "geos"
brew "gdal"
brew "gifsicle"
brew "git"
brew "hub"
brew "hunspell"
brew "igraph"
brew "imagemagick"
brew "jags"
brew "jq"
brew "lftp"
brew "libksba"
brew "libressl"
brew "librsvg"
brew "libsvg"
brew "libxslt"
brew "llvm"
brew "mariadb-connector-c"
brew "mas"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "node"
brew "openjdk"
brew "p7zip"
brew "pandoc"
brew "pipenv"
brew "qt"
brew "poppler"
brew "proj"
brew "psqlodbc"
brew "ruby-build"
brew "rbenv"
brew "rust"
brew "sqliteodbc"
brew "subversion"
brew "tmux"
brew "toilet"
brew "tree"
brew "udunits"
brew "v8"
brew "v8@3.15"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "microsoft/mssql-release/msodbcsql"
brew "microsoft/mssql-release/mssql-tools"

# --> casks
cask "anaconda", args: { appdir: "/Applications" }
cask "calibre"
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "electron"
cask "firefox-nightly", args: { appdir: "/Applications" }
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-fira-mono", args: { appdir: "/Applications" }
cask "font-fira-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-fontawesome"
cask "font-ibm-plex", args: { appdir: "/Applications" }
cask "font-inconsolata", args: { appdir: "/Applications" }
cask "font-inconsolata-for-powerline", args: { appdir: "/Applications" }
cask "font-lato", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "font-roboto-condensed", args: { appdir: "/Applications" }
cask "font-roboto-mono", args: { appdir: "/Applications" }
cask "font-roboto-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-roboto-slab", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2-beta", args: { appdir: "/Applications" }
cask "java", args: { appdir: "/Applications" }
cask "libreoffice", args: { appdir: "/Applications" }
cask "mactex", args: { appdir: "/Applications" }
cask "microsoft-teams", args: { appdir: "/Applications" }
cask "nordvpn"
cask "phantomjs", args: { appdir: "/Applications" }
cask "qbittorrent"
cask "rar"
cask "rectangle"
cask "rstudio"
cask "slack-beta", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "virtualbox"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc-nightly", args: { appdir: "/Applications" }
cask "xquartz", args: { appdir: "/Applications" }

# --> app store
mas "Bear", id: 1091189122
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TickTick", id: 966085870
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
