# my Brewfile for setting up a new Mac
# @robertmitchellv | robertmitchellv.com

# run `brew doctor` before running !!!

# Three times of commands:
#  tap  = third-party-repositories
#  brew = main homebrew command; used to install, uninstall, update, list
#  cask = extend homebrew for GUI macOS applications

# --> args
cask_args appdir: "/Applications"

# --> taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/mssql-release"

# --> first cask
cask "xquartz"

# --> brews
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bat"
brew "bison"
brew "boost"
brew "brew-pip"
brew "openssl@1.1"
brew "readline"
brew "cairo"
brew "carthage"
brew "ccache"
brew "libiconv"
brew "protobuf"
brew "clamav"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "csvkit"
brew "curl"
brew "darksky-weather"
brew "fastlane", link: false
brew "python"
brew "ffmpeg"
brew "figlet"
brew "unixodbc"
brew "freetds"
brew "gcc"
brew "geos"
brew "libxml2"
brew "proj"
brew "poppler"
brew "gdal"
brew "git"
brew "hub"
brew "hunspell"
brew "igraph"
brew "imagemagick"
brew "jags"
brew "jq"
brew "lftp"
brew "libksba"
brew "libressl"
brew "librsvg"
brew "libssh2"
brew "libsvg"
brew "libxslt"
brew "llvm"
brew "mariadb-connector-c"
brew "mas"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "node"
brew "p7zip"
brew "pandoc"
brew "pkg-config"
brew "psqlodbc"
brew "ruby-build"
brew "rbenv"
brew "sqliteodbc"
brew "tcl-tk"
brew "tmux"
brew "toilet"
brew "tree"
brew "udunits"
brew "v8"
brew "v8@3.15"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "heroku/brew/heroku"
brew "microsoft/mssql-release/msodbcsql"
brew "microsoft/mssql-release/mssql-tools"

# --> casks
cask "anaconda"
cask "atom"
cask "azure-data-studio"
cask "discord"
cask "docker"
cask "dropbox-beta"
cask "electron-beta"
cask "fastlane"
cask "firefox-nightly"
cask "font-dejavu-sans"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-lato"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-slab"
cask "gimp"
cask "gitkraken"
cask "google-chrome"
cask "iterm2-beta"
cask "java"
cask "krita"
cask "libreoffice"
cask "mactex"
cask "makemkv"
cask "microsoft-teams"
cask "nteract"
cask "onedrive"
cask "phantomjs"
cask "rstudio-preview"
cask "slack-beta"
cask "soundflower"
cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code-insiders"
cask "vlc-nightly"

# --> app store
mas "Alfred", id: 405843582
mas "Bear", id: 1091189122
mas "TickTick", id: 966085870
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
