# my Brewfile for setting up a new Mac
# @robertmitchellv | robertmitchellv.com

# run `brew doctor` before running !!!

# Three times of commands:
#  tap  = third-party-repositories
#  brew = main homebrew command; used to install, uninstall, update, list
#  cask = extend homebrew for GUI macOS applications

# --> args
cask_args appdir: "/Applications"

# --> taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"

# --> brews
brew "coreutils"
brew "curl"
brew "wget"
brew "mas"
brew "bash-completion"
brew "clamav"
brew "readline"
brew "ncurses"
brew "bison"
brew "git"
brew "hub"
brew "zsh"
brew "vim"
brew "neovim"
brew "tmux"
brew "R"
brew "python"
brew "brew-pip"
brew "gcc"
brew "ccache"
brew "cmake"
brew "pkg-config"
brew "autoconf"
brew "automake"
brew "openssl"
brew "libressl"
brew "libssh2"
brew "libxml2"
brew "libiconv"
brew "libxslt"
brew "pandoc"
brew "cairo"
brew "libsvg"
brew "librsvg"
brew "jags"
brew "llvm"
brew "v8@3.15"
brew "node"
# brew "casperjs"
brew "gdal"
brew "geos"
brew "proj"
brew "protobuf"
brew "poppler"
brew "boost", args: ["with-icu4c", "without-single"]
brew "unixodbc"
brew "freetds", args: ["with-unixodbc"]
brew "psqlodbc"
brew "mysql"
brew "sqliteodbc"
brew "csvkit"
brew "udunits"
brew "aspell"
brew "hunspell"
brew "jq"
brew "imagemagick"
brew "tree"
brew "darksky-weather"
brew "youtube-dl"
brew "cowsay"
brew "figlet"
brew "toilet"
brew "watch"
brew "carthage"
brew "rbenv"

# --> casks
cask "phantomjs"
cask "xquartz"
cask "atom-beta"
cask "anaconda", args: { appdir: "~/code/bin/python/"}
cask "dropbox-beta"
cask "electron-beta"
cask "firefox-nightly"
cask "font-dejavu-sans"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-lato"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-slab"
cask "font-roboto"
cask "gitkraken"
cask "iterm2-beta"
cask "java"
cask "mactex"
cask "rstudio-daily"
cask "slack-beta"
cask "visual-studio-code-insiders"
cask "vlc-nightly"
cask "fastlane"

# --> mas (Apple App Store)
mas "Alfred", id: 405843582
mas "Bitwarden", id: 1352778147
mas "TickTick: Things & Tasks To Do", id: 966085870
mas "Tweetbot For Twitter", id: 557168941
